; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image1 - mode
	thermograph0 - mode
	Star3 - direction
	GroundStation0 - direction
	Star5 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation6 - direction
	Star4 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument5 image1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 Star5)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument6 image1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 image1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation6)
	(supports instrument8 image1)
	(calibration_target instrument8 Star4)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
)
(:goal (and
	(pointing satellite3 GroundStation6)
	(have_image Star7 image1)
	(have_image Star8 image1)
	(have_image Planet9 thermograph0)
	(have_image Star10 image1)
	(have_image Phenomenon11 thermograph0)
	(have_image Star12 thermograph0)
	(have_image Phenomenon13 thermograph0)
	(have_image Planet14 thermograph0)
	(have_image Planet15 image1)
))

)

; plan
1. (turn_to satellite0 star3 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star3)
   goals met: 0 of 10
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 10
3. (calibrate satellite0 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 0 of 10
4. (turn_to satellite0 planet9 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet9)
   goals met: 0 of 10
5. (take_image satellite0 planet9 instrument2 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 1 of 10
6. (turn_to satellite0 planet15 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet15)
   goals met: 1 of 10
7. (take_image satellite0 planet15 instrument2 image1)
   added: (have_image planet15 image1)
   goals met: 2 of 10
8. (turn_to satellite0 planet14 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet14)
   goals met: 2 of 10
9. (take_image satellite0 planet14 instrument2 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 3 of 10
10. (turn_to satellite0 phenomenon13 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 10
11. (take_image satellite0 phenomenon13 instrument2 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 4 of 10
12. (turn_to satellite0 phenomenon11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 10
13. (take_image satellite0 phenomenon11 instrument2 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 5 of 10
14. (turn_to satellite0 star10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star10)
   goals met: 5 of 10
15. (take_image satellite0 star10 instrument2 image1)
   added: (have_image star10 image1)
   goals met: 6 of 10
16. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 6 of 10
17. (take_image satellite0 star12 instrument2 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 7 of 10
18. (turn_to satellite0 star7 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star7)
   goals met: 7 of 10
19. (take_image satellite0 star7 instrument2 image1)
   added: (have_image star7 image1)
   goals met: 8 of 10
20. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 8 of 10
21. (take_image satellite0 star8 instrument2 image1)
   added: (have_image star8 image1)
   goals met: 9 of 10
22. (turn_to satellite3 groundstation6 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 groundstation6)
   goals met: 10 of 10
